ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_gpio.h
/**
 * @defgroup GPIO_AF7_Macros GPIO复用功能AF7宏定义
 * @{
 */
#define GPIO_PA00_AF_ATIM3_GATE()   MODIFY_REG(GPIOA->PIN00_SEL, GPIO_PIN00_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN00_SEL_SEL_Pos)) /*!< ATIM3_GATE   */
#define GPIO_PA01_AF_HSI2C_SCL()    MODIFY_REG(GPIOA->PIN01_SEL, GPIO_PIN01_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN01_SEL_SEL_Pos)) /*!< HSI2C_SCL    */
#define GPIO_PA02_AF_HSI2C_SDA()    MODIFY_REG(GPIOA->PIN02_SEL, GPIO_PIN02_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN02_SEL_SEL_Pos)) /*!< HSI2C_SDA    */
#define GPIO_PA04_AF_ATIM3_BK()     MODIFY_REG(GPIOA->PIN04_SEL, GPIO_PIN04_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN04_SEL_SEL_Pos)) /*!< ATIM3_BK     */
#define GPIO_PA05_AF_ATIM3_ETR()    MODIFY_REG(GPIOA->PIN05_SEL, GPIO_PIN05_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN05_SEL_SEL_Pos)) /*!< ATIM3_ETR    */
#define GPIO_PA06_AF_LVD_OUT()      MODIFY_REG(GPIOA->PIN06_SEL, GPIO_PIN06_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN06_SEL_SEL_Pos)) /*!< LVD_OUT      */
#define GPIO_PA07_AF_ATIM3_GATE()   MODIFY_REG(GPIOA->PIN07_SEL, GPIO_PIN07_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN07_SEL_SEL_Pos)) /*!< ATIM3_GATE   */
#define GPIO_PA08_AF_IR_OUT()       MODIFY_REG(GPIOA->PIN08_SEL, GPIO_PIN08_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN08_SEL_SEL_Pos)) /*!< IR_OUT       */
#define GPIO_PA11_AF_CTRIM_ETRTOG() MODIFY_REG(GPIOA->PIN11_SEL, GPIO_PIN11_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN11_SEL_SEL_Pos)) /*!< CTRIM_ETRTOG */
#define GPIO_PA12_AF_LPUART0_RTS()  MODIFY_REG(GPIOA->PIN12_SEL, GPIO_PIN12_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN12_SEL_SEL_Pos)) /*!< LPUART0_RTS  */
#define GPIO_PA13_AF_ATIM3_BK()     MODIFY_REG(GPIOA->PIN13_SEL, GPIO_PIN13_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN13_SEL_SEL_Pos)) /*!< ATIM3_BK     */
#define GPIO_PA14_AF_TCLK_OUT()     MODIFY_REG(GPIOA->PIN14_SEL, GPIO_PIN14_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN14_SEL_SEL_Pos)) /*!< TCLK_OUT     */
#define GPIO_PA15_AF_RTC_1HZ()      MODIFY_REG(GPIOA->PIN15_SEL, GPIO_PIN15_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN15_SEL_SEL_Pos)) /*!< RTC_1HZ      */
#define GPIO_PB00_AF_ATIM3_BK()     MODIFY_REG(GPIOB->PIN00_SEL, GPIO_PIN00_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN00_SEL_SEL_Pos)) /*!< ATIM3_BK     */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_Data_Action_Macros GPIO数据操作全局宏定义
 * @{
 */

/**
 * @defgroup GPIO_Data_Read_Macros GPIO数据读全局宏定义
 * @{
 */
#define GPIO_PORTA_READ() READ_REG_BIT(GPIOA->IN, GPIO_PIN_ALL) /*!< READ PIN ALL BIT */

#define GPIO_PA00_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_00) /*!< READ GPIOA PIN 00 BIT */
#define GPIO_PA01_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_01) /*!< READ GPIOA PIN 01 BIT */
#define GPIO_PA02_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_02) /*!< READ GPIOA PIN 02 BIT */
#define GPIO_PA03_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_03) /*!< READ GPIOA PIN 03 BIT */
#define GPIO_PA04_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_04) /*!< READ GPIOA PIN 04 BIT */
#define GPIO_PA05_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_05) /*!< READ GPIOA PIN 05 BIT */
#define GPIO_PA06_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_06) /*!< READ GPIOA PIN 06 BIT */
#define GPIO_PA07_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_07) /*!< READ GPIOA PIN 07 BIT */
#define GPIO_PA08_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_08) /*!< READ GPIOA PIN 08 BIT */
#define GPIO_PA09_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_09) /*!< READ GPIOA PIN 09 BIT */
#define GPIO_PA10_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_10) /*!< READ GPIOA PIN 10 BIT */
#define GPIO_PA11_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_11) /*!< READ GPIOA PIN 11 BIT */
#define GPIO_PA12_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_12) /*!< READ GPIOA PIN 12 BIT */
#define GPIO_PA13_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_13) /*!< READ GPIOA PIN 13 BIT */
#define GPIO_PA14_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_14) /*!< READ GPIOA PIN 14 BIT */
#define GPIO_PA15_READ()  READ_REG_BIT(GPIOA->IN, GPIO_PIN_15) /*!< READ GPIOA PIN 15 BIT */

#define GPIO_PB00_READ()  READ_REG_BIT(GPIOB->IN, GPIO_PIN_00) /*!< READ GPIOB PIN 00 BIT */

/**
 * @}
 */

/**
 * @defgroup GPIO_Data_Write_Macros GPIO数据写全局宏定义
 * @{
 */
#define GPIO_PORTA_WRITE(uint16_value)        WRITE_REG(GPIOA->OUT, (uint16_value))                                                /*!< PORTA WRITE */
#define GPIO_PORTA_WRITE_ATOMIC(uint16_value) WRITE_REG(GPIOA->BSETCLR, (((uint32_t)(uint16_value) << 0x10u) | (~(uint16_value)))) /*!< PORTA WRITE ATOMIC */
/**
 * @}
 */

/**
 * @defgroup GPIO_Data_Set_Macros GPIO数据写1全局宏定义
 * @{
 */
#define GPIO_PORTA_SET(pins) WRITE_REG(GPIOA->BSET, (pins)) /*!< SET GPIOA PIN ALL BIT */

#define GPIO_PA00_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_00) /*!< SET GPIOA PIN 00 BIT */
#define GPIO_PA01_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_01) /*!< SET GPIOA PIN 01 BIT */
#define GPIO_PA02_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_02) /*!< SET GPIOA PIN 02 BIT */
#define GPIO_PA03_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_03) /*!< SET GPIOA PIN 03 BIT */
#define GPIO_PA04_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_04) /*!< SET GPIOA PIN 04 BIT */
#define GPIO_PA05_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_05) /*!< SET GPIOA PIN 05 BIT */
#define GPIO_PA06_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_06) /*!< SET GPIOA PIN 06 BIT */
#define GPIO_PA07_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_07) /*!< SET GPIOA PIN 07 BIT */
#define GPIO_PA08_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_08) /*!< SET GPIOA PIN 08 BIT */
#define GPIO_PA09_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_09) /*!< SET GPIOA PIN 09 BIT */
#define GPIO_PA10_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_10) /*!< SET GPIOA PIN 10 BIT */
#define GPIO_PA11_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_11) /*!< SET GPIOA PIN 11 BIT */
#define GPIO_PA12_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_12) /*!< SET GPIOA PIN 12 BIT */
#define GPIO_PA13_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_13) /*!< SET GPIOA PIN 13 BIT */
#define GPIO_PA14_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_14) /*!< SET GPIOA PIN 14 BIT */
#define GPIO_PA15_SET()      WRITE_REG(GPIOA->BSET, GPIO_PIN_15) /*!< SET GPIOA PIN 15 BIT */
/**
 * @}
 */

/**
 * @defgroup GPIO_Data_Reset_Macros GPIO数据清0全局宏定义
 * @{
 */
#define GPIO_PORTA_RESET(pins) WRITE_REG(GPIOA->BCLR, (pins)) /*!< RESET PINS */

#define GPIO_PA00_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_00) /*!< RESET GPIOA PIN 00 */
#define GPIO_PA01_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_01) /*!< RESET GPIOA PIN 01 */
#define GPIO_PA02_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_02) /*!< RESET GPIOA PIN 02 */
#define GPIO_PA03_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_03) /*!< RESET GPIOA PIN 03 */
#define GPIO_PA04_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_04) /*!< RESET GPIOA PIN 04 */
#define GPIO_PA05_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_05) /*!< RESET GPIOA PIN 05 */
#define GPIO_PA06_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_06) /*!< RESET GPIOA PIN 06 */
#define GPIO_PA07_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_07) /*!< RESET GPIOA PIN 07 */
#define GPIO_PA08_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_08) /*!< RESET GPIOA PIN 08 */
#define GPIO_PA09_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_09) /*!< RESET GPIOA PIN 09 */
#define GPIO_PA10_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_10) /*!< RESET GPIOA PIN 10 */
#define GPIO_PA11_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_11) /*!< RESET GPIOA PIN 11 */
#define GPIO_PA12_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_12) /*!< RESET GPIOA PIN 12 */
#define GPIO_PA13_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_13) /*!< RESET GPIOA PIN 13 */
#define GPIO_PA14_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_14) /*!< RESET GPIOA PIN 14 */
#define GPIO_PA15_RESET()      WRITE_REG(GPIOA->BCLR, GPIO_PIN_15) /*!< RESET GPIOA PIN 15 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_CTRL1_Func_Config_Macros GPIO辅助功能配置寄存器1全局宏定义
 * @{
 */

/**
 * @defgroup GPIO_CTRL1_HSI2C_LSEL_Voltage_Select GPIO辅助功能 HSI2C I/O信号有效电平选择类型定义
 * @{
 */
#define GPIO_PA02_PA11_AF_CTRL1_HSI2C_LSEL_NORMAL_VOLTAGE_SET() \
    do \
    { \
        MODIFY_REG(GPIOA->PIN02_SEL, GPIO_PIN02_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN02_SEL_SEL_Pos)); \
        MODIFY_REG(GPIOA->PIN11_SEL, GPIO_PIN11_SEL_SEL_Msk, (GPIO_AF6 << GPIO_PIN11_SEL_SEL_Pos)); \
        CLR_REG_BIT(GPIOAUX->CTRL1, GPIOAUX_CTRL1_HSI2C_LSEL_Msk); \
    } while (0) /*!< 输入电平正常识别   */

#define GPIO_PA02_PA11_AF_CTRL1_HSI2C_LSEL_LOW_VOLTAGE_SET() \
    do \
    { \
        MODIFY_REG(GPIOA->PIN02_SEL, GPIO_PIN02_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN02_SEL_SEL_Pos)); \
        MODIFY_REG(GPIOA->PIN11_SEL, GPIO_PIN11_SEL_SEL_Msk, (GPIO_AF6 << GPIO_PIN11_SEL_SEL_Pos)); \
        SET_REG_BIT(GPIOAUX->CTRL1, GPIOAUX_CTRL1_HSI2C_LSEL_Msk); \
    } while (0) /*!< 输入电平低电压识别 */
/**
 * @}
 */

/**
 * @defgroup GPIO_CTRL1_IR_POL_Polarity_Select GPIO辅助功能IR输出极性选择类型定义
 * @{
 */
#define GPIO_PA08_AF_CTRL1_IR_P_SET() \
    do \
    { \
        MODIFY_REG(GPIOA->PIN08_SEL, GPIO_PIN08_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN08_SEL_SEL_Pos)); \
        CLR_REG_BIT(GPIOAUX->CTRL1, GPIOAUX_CTRL1_IR_POL_Msk); \
    } while (0) /*!< IR正向输出 */

#define GPIO_PA08_AF_CTRL1_IR_N_SET() \
    do \
    { \
        MODIFY_REG(GPIOA->PIN08_SEL, GPIO_PIN08_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN08_SEL_SEL_Pos)); \
        SET_REG_BIT(GPIOAUX->CTRL1, GPIOAUX_CTRL1_IR_POL_Msk); \
    } while (0) /*!< IR反向输出 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_CTRL2_Func_Config_Macros GPIO辅助功能配置寄存器2全局宏定义
 * @{
 */

/**
 * @defgroup GPIO_CTRL2_TCLK_Src_Div_Select GPIO辅助功能TCLK输出信号源和分频选择类型定义
 * @{
 */
#define PA14_AF_TCLK_OUT_SET(sel, div) \
    do \
    { \
        MODIFY_REG(GPIOA->PIN14_SEL, GPIO_PIN14_SEL_SEL_Msk, (GPIO_AF7 << GPIO_PIN14_SEL_SEL_Pos)); \
        MODIFY_REG(GPIOAUX->CTRL2, GPIOAUX_CTRL2_TCLK_DIV_Msk, ((div) << GPIOAUX_CTRL2_TCLK_DIV_Pos)); \
        MODIFY_REG(GPIOAUX->CTRL2, GPIOAUX_CTRL2_TCLK_SEL_Msk, ((sel) << GPIOAUX_CTRL2_TCLK_SEL_Pos)); \
    } while (0) /*!< PA14_AF_TCLK设置 */

#define GPIO_PA14_AF_TCLK_OUT_RC48M_DIV1() PA14_AF_TCLK_OUT_SET(0, 0) /*!< PA14 RC48M TCLK/1 */
#define GPIO_PA14_AF_TCLK_OUT_RC48M_DIV2() PA14_AF_TCLK_OUT_SET(0, 1) /*!< PA14 RC48M TCLK/2 */
#define GPIO_PA14_AF_TCLK_OUT_RC48M_DIV4() PA14_AF_TCLK_OUT_SET(0, 2) /*!< PA14 RC48M TCLK/4 */
#define GPIO_PA14_AF_TCLK_OUT_RC48M_DIV8() PA14_AF_TCLK_OUT_SET(0, 3) /*!< PA14 RC48M TCLK/8 */
#define GPIO_PA14_AF_TCLK_OUT_RCL_DIV1()   PA14_AF_TCLK_OUT_SET(1, 0) /*!< PA14 RCL TCLK/1 */
#define GPIO_PA14_AF_TCLK_OUT_RCL_DIV2()   PA14_AF_TCLK_OUT_SET(1, 1) /*!< PA14 RCL TCLK/2 */
#define GPIO_PA14_AF_TCLK_OUT_RCL_DIV4()   PA14_AF_TCLK_OUT_SET(1, 2) /*!< PA14 RCL TCLK/4 */
#define GPIO_PA14_AF_TCLK_OUT_RCL_DIV8()   PA14_AF_TCLK_OUT_SET(1, 3) /*!< PA14 RCL TCLK/8 */
#define GPIO_PA14_AF_TCLK_OUT_HCLK_DIV1()  PA14_AF_TCLK_OUT_SET(2, 0) /*!< PA14 HCLK TCLK/1 */
#define GPIO_PA14_AF_TCLK_OUT_HCLK_DIV2()  PA14_AF_TCLK_OUT_SET(2, 1) /*!< PA14 HCLK TCLK/2 */
#define GPIO_PA14_AF_TCLK_OUT_HCLK_DIV4()  PA14_AF_TCLK_OUT_SET(2, 2) /*!< PA14 HCLK TCLK/4 */
#define GPIO_PA14_AF_TCLK_OUT_HCLK_DIV8()  PA14_AF_TCLK_OUT_SET(2, 3) /*!< PA14 HCLK TCLK/8 */
#define GPIO_PA14_AF_TCLK_OUT_XTL_DIV1()   PA14_AF_TCLK_OUT_SET(3, 0) /*!< PA14 XTL TCLK/1 */
#define GPIO_PA14_AF_TCLK_OUT_XTL_DIV2()   PA14_AF_TCLK_OUT_SET(3, 1) /*!< PA14 XTL TCLK/2 */
#define GPIO_PA14_AF_TCLK_OUT_XTL_DIV4()   PA14_AF_TCLK_OUT_SET(3, 2) /*!< PA14 XTL TCLK/4 */
#define GPIO_PA14_AF_TCLK_OUT_XTL_DIV8()   PA14_AF_TCLK_OUT_SET(3, 3) /*!< PA14 XTL TCLK/8 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_TIMES_Func_Config_Macros GPIO辅助功能定时器配置全局宏定义
 * @{
 */
/**
 * @defgroup GPIO_TIMES_ATIM3_ETR_Func_Select GPIO辅助功能定时器ATIM3_ETR输入选择定义
 * @{
 */
#define GPIO_TIMES_ATIM3_E_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_ATIM3_E_Msk, (0x0u << GPIOAUX_TIMES_ATIM3_E_Pos)) /*!< ATIM3定时器ETR输入选择 PXY_SEL */
#define GPIO_TIMES_ATIM3_E_LPUART0_RXD() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_ATIM3_E_Msk, (0x1u << GPIOAUX_TIMES_ATIM3_E_Pos)) /*!< ATIM3定时器ETR输入选择 LPUART0_RXD */
#define GPIO_TIMES_ATIM3_E_LPUART1_RXD() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_ATIM3_E_Msk, (0x2u << GPIOAUX_TIMES_ATIM3_E_Pos)) /*!< ATIM3定时器ETR输入选择 LPUART1_RXD */
#define GPIO_TIMES_ATIM3_E_VC0_OUT() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_ATIM3_E_Msk, (0x3u << GPIOAUX_TIMES_ATIM3_E_Pos)) /*!< ATIM3定时器ETR输入选择 VC0_OUT */
#define GPIO_TIMES_ATIM3_E_LVD_OUT() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_ATIM3_E_Msk, (0x4u << GPIOAUX_TIMES_ATIM3_E_Pos)) /*!< ATIM3定时器ETR输入选择 LVD_OUT */

/**
 * @}
 */

/**
 * @defgroup GPIO_TIMES_CTIM1_ETR_Func_Select GPIO辅助功能定时器CTIM1_ETR输入选择定义
 * @{
 */
#define GPIO_TIMES_CTIM1_E_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM1_E_Msk, (0x0u << GPIOAUX_TIMES_CTIM1_E_Pos)) /*!< CTIM1定时器ETR输入选择 PXY_SEL */
#define GPIO_TIMES_CTIM1_E_LPUART1_RXD() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM1_E_Msk, (0x1u << GPIOAUX_TIMES_CTIM1_E_Pos)) /*!< CTIM1定时器ETR输入选择 LPUART1_RXD */
#define GPIO_TIMES_CTIM1_E_VC1_OUT() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM1_E_Msk, (0x2u << GPIOAUX_TIMES_CTIM1_E_Pos)) /*!< CTIM1定时器ETR输入选择 VC1_OUT */

/**
 * @}
 */

/**
 * @defgroup GPIO_TIMES_CTIM0_ETR_Func_Select GPIO辅助功能定时器CTIM0_ETR输入选择定义
 * @{
 */
#define GPIO_TIMES_CTIM0_E_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM0_E_Msk, (0x0u << GPIOAUX_TIMES_CTIM0_E_Pos)) /*!< CTIM0定时器ETR输入选择 PXY_SEL */
#define GPIO_TIMES_CTIM0_E_LPUART0_RXD() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM0_E_Msk, (0x1u << GPIOAUX_TIMES_CTIM0_E_Pos)) /*!< CTIM0定时器ETR输入选择 LPUART0_RXD */
#define GPIO_TIMES_CTIM0_E_VC0_OUT() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM0_E_Msk, (0x2u << GPIOAUX_TIMES_CTIM0_E_Pos)) /*!< CTIM0定时器ETR输入选择 VC0_OUT */
#define GPIO_TIMES_CTIM0_E_LVD_OUT() \
    MODIFY_REG(GPIOAUX->TIMES, GPIOAUX_TIMES_CTIM0_E_Msk, (0x3u << GPIOAUX_TIMES_CTIM0_E_Pos)) /*!< CTIM0定时器ETR输入选择 LVD_OUT */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_TIMCPS_Func_Config_Macros GPIO辅助功能定时器捕获输入配置全局宏定义
 * @{
 */
/**
 * @defgroup GPIO_TIMCPS_ATIM3_C0A_Func_Select GPIO辅助功能定时器ATIM3_C0A输入选择定义
 * @{
 */
#define GPIO_TIMCPS_ATIM3_C0A_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_ATIM3_C0A_Msk, (0x0u << GPIOAUX_TIMCPS_ATIM3_C0A_Pos)) /*!< ATIM3定时器CH0A输入选择 PXY_SEL */
#define GPIO_TIMCPS_ATIM3_C0A_LPUART0_RXD() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_ATIM3_C0A_Msk, (0x1u << GPIOAUX_TIMCPS_ATIM3_C0A_Pos)) /*!< ATIM3定时器CH0A输入选择 LPUART0_RXD */
#define GPIO_TIMCPS_ATIM3_C0A_LPUART1_RXD() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_ATIM3_C0A_Msk, (0x2u << GPIOAUX_TIMCPS_ATIM3_C0A_Pos)) /*!< ATIM3定时器CH0A输入选择 LPUART1_RXD */
#define GPIO_TIMCPS_ATIM3_C0A_VC1_OUT() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_ATIM3_C0A_Msk, (0x3u << GPIOAUX_TIMCPS_ATIM3_C0A_Pos)) /*!< ATIM3定时器CH0A输入选择 VC1_OUT */
/**
 * @}
 */

/**
 * @defgroup GPIO_TIMCPS_CTIM1_C0_Func_Select GPIO辅助功能定时器CTIM1_C0输入选择定义
 * @{
 */
#define GPIO_TIMCPS_CTIM1_C0_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM1_C0_Msk, (0x0u << GPIOAUX_TIMCPS_CTIM1_C0_Pos)) /*!< CTIM1定时器CH1输入选择 PXY_SEL */
#define GPIO_TIMCPS_CTIM1_C0_LPUART0_RXD() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM1_C0_Msk, (0x1u << GPIOAUX_TIMCPS_CTIM1_C0_Pos)) /*!< CTIM1定时器CH1输入选择 LPUART0_RXD */
#define GPIO_TIMCPS_CTIM1_C0_VC0_OUT_O() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM1_C0_Msk, (0x2u << GPIOAUX_TIMCPS_CTIM1_C0_Pos)) /*!< CTIM1定时器CH1输入选择 VC0_OUT_O */
/**
 * @}
 */

/**
 * @defgroup GPIO_TIMCPS_CTIM0_C0_Func_Select GPIO辅助功能定时器CTIM0_C0输入选择定义
 * @{
 */
#define GPIO_TIMCPS_CTIM0_C0_PXY_SEL() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM0_C0_Msk, (0x0u << GPIOAUX_TIMCPS_CTIM0_C0_Pos)) /*!< CTIM0定时器CH0输入选择 PXY_SEL */
#define GPIO_TIMCPS_CTIM0_C0_LPUART1_RXD() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM0_C0_Msk, (0x1u << GPIOAUX_TIMCPS_CTIM0_C0_Pos)) /*!< CTIM0定时器CH0输入选择 LPUART1_RXD */
#define GPIO_TIMCPS_CTIM0_C0_VC1_OUT() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM0_C0_Msk, (0x2u << GPIOAUX_TIMCPS_CTIM0_C0_Pos)) /*!< CTIM0定时器CH0输入选择 VC1_OUT */
#define GPIO_TIMCPS_CTIM0_C0_LVD_OUT() \
    MODIFY_REG(GPIOAUX->TIMCPS, GPIOAUX_TIMCPS_CTIM0_C0_Msk, (0x3u << GPIOAUX_TIMCPS_CTIM0_C0_Pos)) /*!< CTIM0定时器CH0输入选择 LVD_OUT */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup GPIO_FLTCFG_Func_Config_Macros GPIO滤波功能配置配置全局宏定义
 * @{
 */

/**
 * @defgroup GPIO_FLTCFG_Filter_Func_Config GPIO滤波功能配置类型定义
 * @{
 */
#define PA0_FILTER_SET(sel, div) \
    do \
    { \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_DIV_Msk, ((div) << GPIOAUX_FLTCFG_FCLK_DIV_Pos)); \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_SEL_Msk, ((sel) << GPIOAUX_FLTCFG_FCLK_SEL_Pos)); \
        SET_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PA0FLT_EN_Msk); \
    } while (0) /*!< PA0_FILTER设置 */

