ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_gpio.h
#define PA8_FILTER_SET(sel, div) \
    do \
    { \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_DIV_Msk, ((div) << GPIOAUX_FLTCFG_FCLK_DIV_Pos)); \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_SEL_Msk, ((sel) << GPIOAUX_FLTCFG_FCLK_SEL_Pos)); \
        SET_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PA8FLT_EN_Msk); \
    } while (0) /*!< PA8_FILTER设置 */

#define PB0_FILTER_SET(sel, div) \
    do \
    { \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_DIV_Msk, ((div) << GPIOAUX_FLTCFG_FCLK_DIV_Pos)); \
        MODIFY_REG(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_FCLK_SEL_Msk, ((sel) << GPIOAUX_FLTCFG_FCLK_SEL_Pos)); \
        SET_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PB0FLT_EN_Msk); \
    } while (0) /*!< PB0_FILTER设置 */

#define PA0_FILTER_OFF()               CLR_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PA0FLT_EN_Msk) /*!< PA0_FILTER关闭 */
#define PA8_FILTER_OFF()               CLR_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PA8FLT_EN_Msk) /*!< PA8_FILTER关闭 */
#define PB0_FILTER_OFF()               CLR_REG_BIT(GPIOAUX->FLTCFG, GPIOAUX_FLTCFG_PB0FLT_EN_Msk) /*!< PB0_FILTER关闭 */

#define GPIO_PA0_FILTER_OFF()          PA0_FILTER_OFF()     /*!< PA0 FILTER OFF */
#define GPIO_PA0_FILTER_HCLK_DIV1()    PA0_FILTER_SET(0, 0) /*!< PA0 HCLK FCLK/1 */
#define GPIO_PA0_FILTER_HCLK_DIV4()    PA0_FILTER_SET(0, 1) /*!< PA0 HCLK FCLK/4 */
#define GPIO_PA0_FILTER_HCLK_DIV16()   PA0_FILTER_SET(0, 2) /*!< PA0 HCLK FCLK/16 */
#define GPIO_PA0_FILTER_HCLK_DIV64()   PA0_FILTER_SET(0, 3) /*!< PA0 HCLK FCLK/64 */
#define GPIO_PA0_FILTER_RC256K_DIV1()  PA0_FILTER_SET(1, 0) /*!< PA0 RC256K FCLK/1 */
#define GPIO_PA0_FILTER_RC256K_DIV4()  PA0_FILTER_SET(1, 1) /*!< PA0 RC256K FCLK/4 */
#define GPIO_PA0_FILTER_RC256K_DIV16() PA0_FILTER_SET(1, 2) /*!< PA0 RC256K FCLK/16 */
#define GPIO_PA0_FILTER_RC256K_DIV64() PA0_FILTER_SET(1, 3) /*!< PA0 RC256K FCLK/64 */

#define GPIO_PA8_FILTER_OFF()          PA8_FILTER_OFF()     /*!< PA8 FILTER OFF */
#define GPIO_PA8_FILTER_HCLK_DIV1()    PA8_FILTER_SET(0, 0) /*!< PA8 HCLK FCLK/1 */
#define GPIO_PA8_FILTER_HCLK_DIV4()    PA8_FILTER_SET(0, 1) /*!< PA8 HCLK FCLK/4 */
#define GPIO_PA8_FILTER_HCLK_DIV16()   PA8_FILTER_SET(0, 2) /*!< PA8 HCLK FCLK/16 */
#define GPIO_PA8_FILTER_HCLK_DIV64()   PA8_FILTER_SET(0, 3) /*!< PA8 HCLK FCLK/64 */
#define GPIO_PA8_FILTER_RC256K_DIV1()  PA8_FILTER_SET(1, 0) /*!< PA8 RC256K FCLK/1 */
#define GPIO_PA8_FILTER_RC256K_DIV4()  PA8_FILTER_SET(1, 1) /*!< PA8 RC256K FCLK/4 */
#define GPIO_PA8_FILTER_RC256K_DIV16() PA8_FILTER_SET(1, 2) /*!< PA8 RC256K FCLK/16 */
#define GPIO_PA8_FILTER_RC256K_DIV64() PA8_FILTER_SET(1, 3) /*!< PA8 RC256K FCLK/64 */

#define GPIO_PB0_FILTER_OFF()          PB0_FILTER_OFF()     /*!< PB0 FILTER OFF */
#define GPIO_PB0_FILTER_HCLK_DIV1()    PB0_FILTER_SET(0, 0) /*!< PB0 HCLK FCLK/1 */
#define GPIO_PB0_FILTER_HCLK_DIV4()    PB0_FILTER_SET(0, 1) /*!< PB0 HCLK FCLK/4 */
#define GPIO_PB0_FILTER_HCLK_DIV16()   PB0_FILTER_SET(0, 2) /*!< PB0 HCLK FCLK/16 */
#define GPIO_PB0_FILTER_HCLK_DIV64()   PB0_FILTER_SET(0, 3) /*!< PB0 HCLK FCLK/64 */
#define GPIO_PB0_FILTER_RC256K_DIV1()  PB0_FILTER_SET(1, 0) /*!< PB0 RC256K FCLK/1 */
#define GPIO_PB0_FILTER_RC256K_DIV4()  PB0_FILTER_SET(1, 1) /*!< PB0 RC256K FCLK/4 */
#define GPIO_PB0_FILTER_RC256K_DIV16() PB0_FILTER_SET(1, 2) /*!< PB0 RC256K FCLK/16 */
#define GPIO_PB0_FILTER_RC256K_DIV64() PB0_FILTER_SET(1, 3) /*!< PB0 RC256K FCLK/64 */
/**
 * @}
 */

/**
 * @defgroup GPIO_Init_Func_Macros GPIO初始化函数宏定义
 * @{
 */
#define GPIOA_Init(pstcgpioinit) GPIO_Init(GPIOA, (pstcgpioinit))
#define GPIOB_Init(pstcgpioinit) GPIO_Init(GPIOB, (pstcgpioinit))
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/
/*******************************************************************************
 Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup GPIO_Global_Func GPIO全局函数定义
 * @{
 */
void GPIO_Init(GPIO_TypeDef *GPIOx, stc_gpio_init_t *pstcGpioInit); /* GPIO初始化 */

boolean_t GPIO_IntFlagGet(GPIO_TypeDef *GPIOx, uint32_t u32Pin);   /* 中断状态获取 */
void      GPIO_IntFlagClear(GPIO_TypeDef *GPIOx, uint32_t u32Pin); /* 中断状态清除 */

void GPIO_StcInit(stc_gpio_init_t *pstcInit); /* 结构体初始化 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __GPIO_H__ */
/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
